src/Documents/ВводОстатковЗаявокНаЗакупку/ВводОстатковЗаявокНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатковЗаявокНаЗакупку</name>
  <registerRecords>AccumulationRegister.ЗаявкиНаЗакупку</registerRecords>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаЗакупку</name>
      <type>
        <types>DocumentRef.ЗаявкаНаЗакупку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ЗаявкиНаЗакупку/ЗаявкиНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаявкиНаЗакупку</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаНаЗакупку</name>
    <type>
      <types>DocumentRef.ЗаявкаНаЗакупку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ВводОстатковЗаявокНаЗакупку/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
// регистр ЗаявкиНаЗакупку Приход
Движения.ЗаявкиНаЗакупку.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
	Движение = Движения.ЗаявкиНаЗакупку.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Подразделение = Подразделение;
	Движение.МПЗ = ТекСтрокаТабличнаяЧасть.МПЗ;
	Движение.Количество = ТекСтрокаТабличнаяЧасть.Количество;
	Движение.ЗаявкаНаЗакупку = ТекСтрокаТабличнаяЧасть.ЗаявкаНаЗакупку;
	КонецЦикла;
КонецПроцедуры
